HiddenPage  Kommentar
<h3>
Kommentar zu <a href="/dasher/movies/20020520_demo.asf">Streaming Video
Demonstration (1.5 min, 2.7 Mb asf-Datei)</a>:</h3>
<!-- Translators -- probably no point in translating this file unless you are very enthusiastic about translating! -->[Z&auml;hlen
Sie bis 3]
<br>&nbsp;Dies ist die Bildschirmanzeige von Dasher. Gleich sehen Sie,
wie Dasher
<br>dazu benutzt wird, "hello how are you" oder "Hallo, wie geht's?" zu
schreiben.
<p>Rechts sind die Buchstaben in alfabetischer Reihenfolge geordnet. Ganz
unten befindet sich der Unterstrich als Ersatz f&uuml;r das Leerzeichen.
<p>Sobald Sie den Mauszeiger nach rechts bewegen, rollen die Buchstaben
&uuml;ber den
<br>Bildschirm.
<p>Jeder Buchstabe befindet sich in einem Kasten. In jedem Kasten befindet
sich wieder ein komplettes Alphabet und in jedem Buchstaben dieser Alphabete
ist wiederum ein neues Alphabet usw.
<p><font face="Times New Roman,Times">Die Schl&uuml;sselrolle von Dasher
besteht darin, dass die Gr&ouml;&szlig;e der Buchstabenk&auml;sten von
der Wahrscheinlichkeit abh&auml;ngt, mit der ein n&auml;chster Buchstabe
wohl ausgew&auml;hlt werden wird - und das h&auml;ngt davon ab, was Sie
bisher geschrieben haben. Unwahrscheinliche Buchstaben sind oft zu klein
f&uuml;r die Bildschirmanzeige. Deshalb erscheinen Ihnen die Alfabete in
den K&auml;sten manchmal unvollst&auml;ndig. Wahrscheinliche Buchstaben
stehen in gro&szlig;en K&auml;sten, deshalb k&ouml;nnen Sie die nachfolgenden
Buchstaben meistens leicht und schnell ausw&auml;hlen. Wenn Sie 1 oder
2 Buchstaben eines h&auml;ufigen Wortes oder Satzteils geschrieben haben,
sieht die Software oft nicht weniger als das ganze n&auml;chste Wort voraus.
Gerade deshalb k&ouml;nnen Sie mit Dasher leichter und schneller schreiben.</font>
<p>Je weiter sich der Mauszeiger auf der rechten Seite befindet, desto
schneller
<br>bewegen sich die Buchstaben. Deren Bewegung verlangsamen Sie, indem
Sie die Maus nach links ziehen.
<br>Durch Auf- oder Abbewegung w&auml;hlen Sie Buchstaben aus. Es f&uuml;hlt
sich an wie
<br>vorausschauendes Steuern eines Boots. K&ouml;nnen Sie Ihren n&auml;chsten
Buchstaben
<br>nicht sehen, so steuern Sie dorthin, wo Sie ihn nach alfabetischer
Reihenfolge
<br>erwarten. Er wird bald erscheinen.
<p>Es macht Spa&szlig;! Und vergessen Sie nicht: Diese Demonstration wurde
absichtlich
<br>gebremst, um Ihnen auf anschauliche Weise zu zeigen wie Dasher funktioniert.
<br>Mit ein bisschen &Uuml;bung werden Sie viel schneller schreiben k&ouml;nnen.
<br>&nbsp;
