SectionPage Geschichte
<img SRC="/dasher/images/tclS.gif" ALT="early dasher" BORDER=0 height=68 width=96 align=RIGHT>
<h2>
Die Geschichte von Dasher</h2>

<h3>
"Who is who"</h3>

<ul>
<li>
Sie erhalten Dasher von der <a href="/is/">Inference Group</a>, geleitet
von <b><a href="/mackay/">David MacKay</a></b>, der als Privatdozent an
der Universit&auml;t Cambridge in der Fakult&auml;t Physik t&auml;tig und
Mitbegr&uuml;nder des IT-Unternehmens <a href="http://www.transversal.com/">Transversal</a>
ist. 1997 schuf David den ersten Prototyp von Dasher.</li>

<li>
<b><a href="/djw30/">David Ward</a></b> entwickelte von 1998 bis 2002 die
Forschungsversion von Dasher; zu seiner Promotion machte David aus Dasher
ein funktionierendes Softwaresystem, erfand zahlreiche Verbesserungen und
f&uuml;hrte Experimente durch, um das gute Funktionieren von Dasher quantitativ
zu erfassen. David arbeitet jetzt f&uuml;r Spiral Software, Cambridge.</li>

<li>
<b><a href="http://www.cl.cam.ac.uk/~afb21/">Alan Blackwell</a></b>, Professor
im Computerlabor, half uns beim experimentellen Design.</li>

<li>
<b><a href="/pjc51/">Phil Cowans</a></b> and <b>Tim Hospedales</b> haben
insbesondere zur Einbindung des Eyetrackers beigetragen.</li>

<li>
Im Sommer 2002 wurde das Open Source Softwarepaket von <b><a href="/~iam23/">Iain
Murray</a></b> f&uuml;r die Auslieferung vorbereitet. Iain begann an der
Universit&auml;t Cambridge im Oktober 2002 mit der Promotion im Fach computational
neuroscience.</li>

<li>
Phil schuf die Version 3 von Dasher f&uuml;r GNU/linux, Hanna Wallach f&uuml;r
ipaq-linux.</li>

<li>
Im December 2002 wurde das Dasher project von der Gatsby Foundation unterst&uuml;tzt,
um Matthew Garrett als Projectbeauftragten und Entwickler zu f&ouml;rdern.
Au&szlig;erdem beteiligen sich an dem Projekt Experten aus der free software
community. Sie leisten weitere Beitr&auml;ge zu Verbesserungen und zu Transfer
und Anpassung auf eine noch gr&ouml;&szlig;ere Vielfalt von Computerplattformen.</li>
</ul>
<img SRC="/dasher/images/ipaq4.jpg" ALT="Dasher on ipaq" BORDER=0 height=95 width=96 align=RIGHT>
<h2>
Versionen von Dasher</h2>
Die grundlegenden Arbeitsversionen von Dasher sind:
<dl>
<dt>
<b><a href="http://www.inference.phy.cam.ac.uk/djw30/dasher/download.html">Version
1.*.* - C und tcl</a></b> - f&uuml;r GNU/Linux und Windows-Desktops.</dt>

<dd>
Das verwendete Sprachmodell ist ppm. Diese Version ist mausgesteuert und
wurde von David Ward geschrieben.</dd>

<br>Version 1.*.* unterst&uuml;tzt mehrere Europ&auml;ische Sprachen und
Japanisch (Hiragana). Die englische Version unterst&uuml;tzt auch Gro&szlig;-
und Kleinbuchstaben. Das Sprachmodell dieser Version kann sowohl durch
laden einer Eingabedatei instruiert werden als auch durch Laden eines Verzeichnisses
g&uuml;ltiger Buchstabenfolgen.
<dt>
<b><a href="http://www.inference.phy.cam.ac.uk/djw30/dasher/download.html">C</a>
- f&uuml;r pocket PC</b></dt>

<br>Die Steuerung erfolgt &uuml;ber einen Stift auf der touch-screen; geschrieben
von David Ward.
<br>Diese Version beinhaltet Gro&szlig;buchstaben, Zahlen und einige Interpunktionszeichen.
Es wird nur Englisch unterst&uuml;tzt.
<dt>
<b><a href="http://www.inference.phy.cam.ac.uk/djw30/dasher/download.html">Version
2.*.* - C </a></b>- f&uuml;r GNU/Linux und Windows-Desktops</dt>

<dd>
Version 2.*.* unterst&uuml;tzt Englisch, Gro&szlig;- und Kleinbuchstaben,
Interpunktion und Zahlen. Es wurde als <b>Open Source</b>, und zwar als
<b>Version
3</b> im Sp&auml;tsommer 2002 herausgegeben.</dd>

<dt>
<b>Eye-Dasher</b></dt>

<br><img SRC="/dasher/images/hires/mini96028.jpg" ALT="dasher + Eye-tracker" BORDER=0 height=72 width=96 align=RIGHT>
<dd>
Der Eyetracker &uuml;bernimmt die Maussteuerung.</dd>

<br>(von David Ward geschrieben.)
<dt>
<b>Daishoya (JDasher)</b></dt>

<dd>
Diese japanische Version von Dasher (Hiragana) ist integriert in die <b><a href="http://www.inference.phy.cam.ac.uk/djw30/dasher/download.html">C
und tcl</a></b> -Version.</dd>

<dt>
<b><a href="http://www.inference.phy.cam.ac.uk/mackay/tcl/dasher.tcl">tcl</a></b>
, der urspr&uuml;ngliche Prototyp, demonstriert die Beziehung zur arithmetischen
Codierung und beinhaltet ein einfaches bigrames (von David MacKay geschriebenes)
Sprachmodell.</dt>

<br>Es ist auf allen Plattformen einsatzf&auml;hig, die tcl unterst&uuml;tzen
(GNU/Linux, Windows, einige Browser).</dl>
Wenn Sie sich f&uuml;r eine detaillierte Geschichte von Dasher interessieren,
wenden Sie sich bitte an <a href="/mackay/">David MacKay</a> .
<p><a href="../Others.html">Hier sind Links zu weiteren Arbeitsgrupen,
die auf dem gleichen Gebiet arbeiten</a>.
