HiddenPage Tipps for Neulinge 
<img align=right src="/dasher/images/logo35.png" alt="logo" width="35" height="35">
<h2>
Tipps for Neulinge ... Fortsetzung</h2>
<b>Die &uuml;blichen Fehler.</b>
<br>Anf&auml;nger versuchen h&auml;ufig, den n&auml;chsten Buchstaben bei
beschleunigter Anzeige zu jagen. F&uuml;r Dasherbenutzer lautet die Verkehrsregel
ebenso wie f&uuml;r Autofahrer: Fahre erst an, wenn Du wei&szlig;t, wohin
Du f&auml;hrst und wohin Du fahren willst! Nachdem Sie also den ersten
Buchstaben Ihres Satzes gefunden haben und in den Kasten hineingezoomt
sind, bitte <b>VERLANGSAMEN und nicht weiter in diesen Kasten hineinfahren,
bis Sie herausgefunden haben, wohin Sie jetzt steuern sollten</b>. Ihr
n&auml;chster Buchstabe *ist* vorhanden, genau in dem ersten von Ihnen
betretenen K&auml;stchen. Die Buchstaben sind alfabetisch geordnet. K&ouml;nnen
Sie Ihren Buchstaben nicht sehen, so &uuml;berlegen Sie aufgrund der <i>sichtbaren</i>
Buchstaben, wo er sich wohl befinden muss. Danach zeigen Sie auf die richtige
Stelle und bestimmen den zweiten Buchstaben.
<p><b>Was bedeuten die Farben?</b>
<br>In der Englischen Desktopversion von Dasher enthalten <b>wei&szlig;e</b>
K&auml;stchen die Leerbuchstaben; Die &uuml;brigen Farben werden nur verwendet,
um die K&auml;stchen voneinander zu unterscheiden.
<br>In der Pocket-PC und der Japanischen Version von Dasher haben manche
Farben zus&auml;tzliche Bedeutungen.
<p>Fazit:
<br><b>Nicht klicken. Nicht ziehen. Und gem&uuml;tlich fahren.</b>
<h5>
So wird Dasher gestartet:</h5>

<ul>
<li>
<b>Windows</b>: Nach der Installation von Dasher auf dem PC w&auml;hlen
Sie Dasher an. Sobald das Dasher-Fenster erscheint, klicken Sie entweder
die linke Maustaste oder dr&uuml;cken die Leertaste. [Durch eins von beiden
wird Dasher bestimmt gestartet.] Wenn Sie Dasher beenden wollen, klicken
Sie noch einmal links oder bet&auml;tigen die Leertaste. Ihre Maus kontrolliert
Dasher.</li>

<li>
<b>Linux</b>: Nach der Installation von Dasher auf dem PC&nbsp; gehen Sie
in das Verzeichnis, WO&nbsp; SIE&nbsp; Dasher&nbsp; INSTALLIERT&nbsp; HABEN
und starten Sie es durch Eingabe von <b>dasher</b>. [Starten Sie Dasher
keinesfalls aus einem anderen Verzeichnis. Es w&uuml;rde die &Uuml;bungsdateien
nicht finden].&nbsp; Sobald das Dasher-Fenster erscheint, klicken Sie entweder
die linke Maustaste oder dr&uuml;cken die Leertaste. [Durch eins von beiden
wird Dasher bestimmt gestartet.] Wenn Sie Dasher beenden wollen, klicken
Sie noch einmal links oder bet&auml;tigen die Leertaste. Ihre Maus kontrolliert
Dasher.</li>

<li>
<b>Pocket PC</b>: Nach der Installation k&ouml;nnen Sie Dasher gleich starten
(warten Sie ein paar Sekunden, bis es die &Uuml;bungsdatei geladen hat).
Danach br&uuml;hren Sie den Bildschirm mit dem Stift und Dasher wird sich
bewegen.</li>

<p>Bei Verwendung der PocketPC-Version von Dasher lesen Sie bitte <a href="ipaqtips.html">diese
zus&auml;tzlichen Tipps</a>.</ul>
<b>Die n&auml;chsten Schritte</b>
<br>Dr&uuml;cken Sie nicht das "Experiment" Men&uuml;. Es lohnt sich mit
den Men&uuml;s "Datei" and "Bearbeiten" zu spielen, wenn Sie zum Beispiel
Gro&szlig;buchstaben schreiben wollen. Sobald Sie aus dem Anf&auml;ngerstadium
herausgewachsen sind, werden Sie Dasher zu langsam finden. W&auml;hlen
Sie&nbsp; "Bearbeiten" -> Optionen and erh&ouml;hen Sie die max. Datenrate
("Maxbitrate").
<p>Bitte senden Sie uns Ihre Anregungen und Kommentare auf einem der
<a href="Develop.html">3
hier genannten Wege</a>. Der Quellcode kann ab Sommer 2002 &uuml;ber eine
Open-Source-Lizenz bezogen werden.
<p>Dasher macht Spa&szlig;!&nbsp; <a href="users.html">Sehen Sie selbst,
was Anwender aus aller Welt dazu sagen.)</a>.
<p>Zur&uuml;ck zu: <a href="tips.html">Wichtige Tipps f&uuml;r Anf&auml;nger</a>
