 <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><HEAD><META NAME="GENERATOR" CONTENT="Generated by website.p, free software from TradeNotAid.com - dedicated to making the web useful for poor countries"><META content="text/html; charset=iso-8859-2" http-equiv=Content-Type>
<link rel="shortcut icon" href="/favicon.ico">
<Title>
Inference Group: Das Dasher Projekt: Presseausgabe 
</Title>
<STYLE TYPE="TEXT/CSS"><!--
H4,P,TD,TH,UL,DD,DT,DL,OL { font-family:  'Lucida Grande', Verdana, Geneva, Lucida, Arial, Helvetica, sans-serif}
P.indented {margin-left:0.5cm; margin-right:0.5cm}
BODY,DIV { font-family:  'Lucida Grande', Verdana, Geneva, Lucida, Arial, Helvetica, sans-serif;}
TT,PRE { font-family: Courier, monospace;}
SUP,SUB,SMALL { font-size: 90%}
.smaller { font-size: 80%}
SPAN.header { font-family: times, roman; font-size: 200%}
H1 { font-family:  'Lucida Grande', Verdana, Geneva, Lucida, arial, helvetica, sans serif; font-size: 180%}
H2 { font-family:  'Lucida Grande', Verdana, Geneva, Lucida, arial, helvetica, sans serif; font-size: 135%}
H3 { font-family:  'Lucida Grande', Verdana, Geneva, Lucida, arial, helvetica, sans serif; font-size: 120%}
abbr, acronym, .help {
  border-bottom: 1px dotted #333;
  cursor: help;
}
--></STYLE></HEAD>
<BODY BGCOLOR="#ffffee"  TEXT="#000000" LINK="#0000C8" ALINK="#C80000" VLINK="#C80000">
<!----- This is the master table that everything sits inside--->
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0>
<TR valign=top><!--This row is the parent organization head bar -->
<td colspan="2"  bgcolor="#beffd4"> <center> 
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0><tr><td  >
<center> <b><A style="text-decoration: none" HREF="http://www.inference.phy.cam.ac.uk/is/">Inference Group</a></b> </center> 
</td>
</tr></table>
</center> </td>
</tr> 
<tr bgcolor=#008080  cellpadding=0><td colspan=3 cellpadding=0><img src="/images/pixel.gif" width="1" height="4" alt="."></td></tr>
<TR valign=top><!--This row contains the first bit of the navigation column (left) and the body of the page (right) -->
<!--begin sidebar-->
<TD height="400" VALIGN=TOP WIDTH="150" BGCOLOR="#95ffff">
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0><tr>
<td width=4><img src="/images/pixel.gif" width="4" height=1></td>
<td VALIGN=TOP WIDTH="150" >
<font face="Helvetica">
<br><div> <center><a HRef="./" ><font size=+1><b>Das Dasher Projekt</b></font></a></center></div>
<br><div> <table width=100% cellpadding=0 cellspacing=0 border=0>
<tr valign=top><td colspan=2 width=-2 nowrap><b><a hRef="./" >Home</a></b>&nbsp;</td></tr>
<tr><td><img src=/images/pixel.gif width=1 height=6 alt="."></td></tr><tr valign=top><td colspan=2 width=-2 nowrap><b><a hRef=DasherSummary.html >Wozu gibt es Dasher?</a></b>&nbsp;</td></tr>
<tr><td><img src=/images/pixel.gif width=1 height=6 alt="."></td></tr><tr valign=top><td colspan=2 width=-2 nowrap><b><a hRef=DasherSummary2.html >Wie funktioniert Dasher?</a></b>&nbsp;</td></tr>
<tr valign=top><td width=7 >&#183;</td><td width=-9 nowrap><a hRef=Novice.html >Wir erkl&auml;ren (Drei Seiten) </a>&nbsp;</td></tr>
<tr valign=top><td width=7 >&#183;</td><td width=-9 nowrap><a hRef=Demonstrations.html >Demonstrations</a>&nbsp;</td></tr>
<tr><td><img src=/images/pixel.gif width=1 height=6 alt="."></td></tr><tr valign=top><td colspan=2 width=-2 nowrap><b><a hRef=Download.html >Download </a></b>&nbsp;</td></tr>
<tr valign=top><td width=7 >&#183;</td><td width=-9 nowrap><a hRef=tips.html >Tips for Novices</a>&nbsp;</td></tr>
<tr><td><img src=/images/pixel.gif width=1 height=6 alt="."></td></tr><tr valign=top><td colspan=2 width=-2 nowrap><b><a hRef=SpecialNeeds.html >Special Needs</a></b>&nbsp;</td></tr>
<tr><td><img src=/images/pixel.gif width=1 height=6 alt="."></td></tr><tr valign=top><td colspan=2 width=-2 nowrap><b><a hRef=Languages.html >Languages</a></b>&nbsp;</td></tr>
<tr><td><img src=/images/pixel.gif width=1 height=6 alt="."></td></tr><tr valign=top><td colspan=2 width=-2 nowrap><b><a hRef=Directions.html >Future directions</a></b>&nbsp;</td></tr>
<tr><td><img src=/images/pixel.gif width=1 height=6 alt="."></td></tr><tr valign=top><td colspan=2 width=-2 nowrap><b><a hRef=Publications.html >Publications</a></b>&nbsp;</td></tr>
<tr><td><img src=/images/pixel.gif width=1 height=6 alt="."></td></tr><tr valign=top><td colspan=2 width=-2 nowrap><b><a hRef=History.html >Geschichte</a></b>&nbsp;</td></tr>
<tr><td><img src=/images/pixel.gif width=1 height=6 alt="."></td></tr><tr valign=top><td colspan=2 width=-2 nowrap><b><a hRef=Develop.html >Development</a></b>&nbsp;</td></tr>
<tr><td><img src=/images/pixel.gif width=1 height=6 alt="."></td></tr><tr valign=top><td colspan=2 width=-2 nowrap><b><a hRef=News.html >in den Medien</a></b>&nbsp;</td></tr>
<tr><td><img src=/images/pixel.gif width=1 height=6 alt="."></td></tr><tr valign=top><td colspan=2 width=-2 nowrap bgcolor="#ffffee" ><b><em><a hRef=Press.html >Presseausgabe</a></em>&nbsp;<b>&#171;</b></b>&nbsp;</td></tr>
<tr valign=top><td width=7 >&#183;</td><td width=-9 nowrap><a hRef=Images.html >Images</a>&nbsp;</td></tr>
</table>
</div>
<br><div> <b><a href="http://www.metafaq.com/faq/dasher/">Any questions?<br><img border=0 src="/images/mfsmallcyan.gif" alt="metafaq" width="100" height="26"></a></b></div>
<br><div> </div>
<br><div> <FORM METHOD=GET ACTION="http://web-search.cam.ac.uk/query.html">
Search :
<INPUT NAME="qp" TYPE="hidden" VALUE="site:www.inference.phy.cam.ac.uk">
<INPUT NAME="qt" TYPE="text" SIZE=10 VALUE="">
</FORM>
</div>
</font>
</td></tr></table>
</td>
<!--end sidebar-->
<td  bgcolor=#008080 width=1 rowspan=1><img src="/images/pixel.gif" width="1" height="1" alt="."></td>
<TD rowspan=1 VALIGN=TOP WIDTH="580" BGCOLOR="#ffffee" >
<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=8><tr><td VALIGN=TOP WIDTH="580" >
<font face="Helvetica">
<img align=right src="/dasher/images/logo35.png" alt="logo" width="35" height="35">

<h5>
Presseausgabe, 21. August 2002</h5>
<!--- Translators: please do not translate the rest of this page --->
<h3>
Die Augen haben es in sich</h3>
<b>Schnell schreiben ohne Tastatur</b>
<p>An der Universit&auml;t Cambridge wurde ein neues Texteingabesystem
entwickelt, das den Umgang mit Computern revolutionieren k&ouml;nnte -
f&uuml;r Menschen, die nicht in der Lage sind, eine Tastatur zu bedienen.
<table ALIGN=RIGHT >
<tr>
<td>
<center><a href="Images.html"><img SRC="/dasher/images/hires/mini96028.jpg" ALT="hands-free writing - click for more images" BORDER=0 height=72 width=96></a>
<br><a href="Images.html">More images</a></center>
</td>
</tr>
</table>
Das Texteingabesystem nennt sich Dasher. Es wurde von David MacKay und
David Ward in der dortigen Fakult&auml;t f&uuml;r Physik entworfen und
kann &uuml;ber einen Eyetracker gesteuert werden - eine Kamera, die aufzeichnet,
auf welche Stelle des Bildschirms der Anwender gerade schaut.
<p>"Die Software funktioniert wie ein Videospiel, wo der Anwender immer
tiefer in eine riesige Bibliothek hineinsteuert", erl&auml;utert Dr. MacKay.
"Mit dem eingesetzten Sprachmodell wird diese Bibliothek so gestaltet,
dass schnell und leicht die wahrscheinlichen Zeichenfolgen ausgew&auml;hlt
und dass Buchstabierfehler erschwert werden."
<p>Das System wird in der heutigen Nature-Ausgabe beschrieben (22. August
2002). Es ist viel schneller als alle anderen Schreibsysteme, die durch
Eyetracker gesteuert werden. Experimente haben gezeigt, dass Dasher bis
zu 25 W&ouml;rter pro Minute schreiben kann. Anwender die &uuml;ber einen
Eyetracker auf einer am Bildschirm agebildeten Tastatur schreiben, schaffen
nur 15 W&ouml;rter pro Minute. "Es ist nicht nur schneller als jedes alternative
Schreibsystem mit Eyetrackersteuerung - die H&auml;ufigkeit von Buchstabierfehlern
ist ungef&auml;hr f&uuml;nfmal kleiner - und die Benutzung des neuen Systems
ist auch weniger stressig", f&uuml;gt Dr. MacKay hinzu.
<p>Die Arbeitsweise von Dasher ist besonders differenziert, weil es durch
nat&uuml;rliche Zeige-Gesten gesteuert wird. Es baut auf der nat&uuml;rlichen
menschlichen F&auml;higkeit auf, hochpr&auml;zise analoge Bewegungen auszuf&uuml;hren.
Auf einer Tastatur wird der Text mit Alles-oder-Nichts-Bewegungen eingegeben
und die genannte F&auml;higkeit wird nicht genutzt.
<p>Dasher unterscheidet auch nicht zwischen kompletten W&ouml;rtern und
dem normalen Schreibvorgang. Andere Schreibsysteme schlagen auf einem separaten
Sektor des Displays W&ouml;rter vor, und der Anwender muss durch Schauen
oder Zeigen eine Auswahl treffen. Dashers Vorschl&auml;ge sind wie selbstverst&auml;ndlich
in den Schreibprozess integriert. Das Sprachmodell passt sich an den individuellen
Schreibstil des Anwenders an, sodass mehrere W&ouml;rter manchmal auf einen
Blick geschrieben werden k&ouml;nnen.
<p>Dasher ist besonders hilfreich f&uuml;r Computeranwender, die nicht
in der Lage sind, eine herk&ouml;mmliche Tastatur zu bedienen. Weil es
&uuml;ber ein beliebiges Zeigehilfsmittel gesteuert werden kann - Maus,
Trackball, Touchpad, oder Eyetracker - ist es auch auf Handhelds oder Mobiltelefonen
einsetzbar, wo die Tastatur aus Platzgr&uuml;nden fehlt. Au&szlig;erdem
besitzt es ein Potential als Eingabesystem f&uuml;r andere Sprachen, wie
z.B. Japanisch.
<p>David MacKay und David Ward planen, Dasher als Open-Source-Software
vergleichbar mit GNU/Linux weiterzuentwickeln.
<p><b>Hinweise f&uuml;r Herausgeber:</b> Der Artikel "Fast hands-free writing
by gaze direction" (freih&auml;ndig mit dem Blick Schnellschreiben), wurde
von David J. Ward und David J.C. MacKay in "Nature" am 22. August 2002
publiziert.
<br>N&auml;here Informationen &uuml;ber Dasher einschlie&szlig;lich Videodemonstrationen
und <a href="Images.html">Images</a> erhalten Sie bei:
<a href="http://www.inference.phy.cam.ac.uk/dasher/">http://www.inference.phy.cam.ac.uk/dasher/</a>.
<br><a href="../QA.html">Weitere Presseinformationen sind online verf&uuml;gbar</a>.
<p>Falls Sie weitere Informationen w&uuml;nschen, wenden Sie sich bitte
an:
<br>David MacKay, Department of Physics, University of Cambridge.
<br>Tel: 01223 339852; e-mail: mackay&#64;mrao.cam.ac.uk
<p>Alison McFarquhar, Press and Publications Office, University of Cambridge.
<br>Tel: 01223 332300; e-mail: am353&#64;cam.ac.uk
<p><a href="http://www.admin.cam.ac.uk/news/press/index.cgi">Cambridge
University's press office.</a>
<br>EndPage Alias QA.html FoldingPage Further Press Info
<h2>
Presseinformation</h2>
<font size=-1>Zug&auml;nglich ab 19:00 Uhr British Meaning Time / 1400
US Eastern Time, 21. August 2002</font>
<h5>
Einige h&auml;ufig gestellte Fragen (FAQs)</h5>

<ul>
<li>
<a href="Press.html#q01">Warum haben Sie Dasher erfunden?</a></li>

<li>
<a href="Press.html#q02">F&uuml;r wen ist Dasher gedacht?</a></li>

<li>
<a href="Press.html#q10">Wie kamen Sie auf die Idee der Schnittstelle mit invers-arithmetischer
Codierung?</a></li>

<li>
<a href="Press.html#q11">Wie funktioniert die Texteingabe?</a></li>

<li>
<a href="Press.html#q11">Wie funktioniert</a><a href="#q12"> arithmetische Codierung?</a></li>

<li>
<a href="Press.html#q13">Wie passt sich das Modell der Sprache des Schreibenden an?</a></li>

<li>
<a href="Press.html#q14">Wie sehr erm&uuml;den die Augen bei dieser Methode?</a></li>

<li>
<a href="Press.html#q15">Wie schnell ist die Methode im Vergleich zu anderen Texteingabemethoden?</a></li>

<li>
<a href="Press.html#q15a">Wie lange braucht man, um mit Dasher englisch schreiben
zu lernen?</a></li>

<li>
<a href="Press.html#q16">K&ouml;nnen Sie eine Person beschreiben, die sowohl einige
S&auml;tze mit Ihrer Methode als auch mit der Tastatur auf dem Bildschirm
geschrieben hat?</a></li>

<li>
<a href="Press.html#q17">Welche technischen Hindernisse waren zu &uuml;berwinden,
damit Dasher funktioniert?</a></li>

<li>
<a href="Press.html#q18">Was war an den Ergebnissen &uuml;berraschend?</a></li>

<li>
<a href="Press.html#q18b">Sie behaupten, Dasher verursache weniger Buchstabierfehler
als Standardmethoden. Aber - wie ernsthaft wurden die Fehler ausgewertet
und verglichen?</a></li>

<li>
<a href="Press.html#q18c">F&uuml;nfundzwanzig W&ouml;rter pro Minute zu schreiben
ist immer noch langsamer als sprechen. Warum w&uuml;rde jemand Dasher verwenden,
wenn er stattdessen eine Spracherkennung benutzen k&ouml;nnte?</a></li>

<li>
<a href="Press.html#q18a">Wieviel Rechenleistung ben&ouml;tigt Dasher?</a></li>

<li>
<a href="Press.html#q19">Wie f&uuml;gt sich Ihr Werk in die Arbeitsumgebung von Textkompression,
Texteingabe und die Mensch-Computer-Wechselbeziehung im Allgemeinen ein
- und wo liegen die Unterschiede?</a></li>

<li>
<a href="Press.html#q20">Wie k&ouml;nnen diese Forschungsergebnisse praktisch angewendet
werden?</a></li>

<li>
<a href="Press.html#q21">Welche Eingabe wird sich auf lange Sicht durchsetzen?</a></li>

<li>
<a href="Press.html#q21a">Nach Ihren Angaben kann Dasher in den meisten Sprachen
eingesetzt werden. Wie wird es wohl Ihrer Erwartung nach im Japanischen
verwendet?</a></li>

<li>
<a href="Press.html#q22a">Wie viele Menschen haben Dasher schon benutzt?</a></li>

<li>
<a href="Press.html#q22">Was werden die n&auml;chsten Schritte Ihrer Forschung sein?
Was ist letztendlich Ihr Ziel?</a></li>

<li>
<a href="Press.html#q23">Wann werden Ihre Forschungsergebnisse umsetzungsreif sein?</a></li>

<li>
<a href="Press.html#q23b">Wann wird eine konsumententaugliche Version von Dasher
fertiggestellt sein?</a></li>

<li>
<a href="Press.html#q23a">Warum wird Dasher als Open-Source-Projekt betrieben?</a></li>

<li>
<a href="Press.html#q24">Von wem wurde die Forschung gef&ouml;rdert?</a></li>

<li>
<a href="Press.html#q25">Was ist Ihr "Dienstgrad"?</a></li>

<li>
<a href="Press.html#q26">Was w&uuml;rden Sie sonst noch gerne sagen?</a></li>
</ul>

<hr noshade size=1>
<dl>
<hr noshade size=1>
<dt>
<a NAME="q01"></a><b>Warum haben Sie Dasher erfunden?</b></dt>

<br>&nbsp;
<p>Ich (David MacKay) war &uuml;berzeugt, dass Standardtexteingabesysteme
(wie Zehnfingertastaturen) sehr ineffizient sind - sie besitzen nicht die
Vorhersagekraft der nat&uuml;rlichen Sprache und sie nutzen unsere F&auml;higkeit
zu hochpr&auml;zisen Gesten nicht aus.
<p>I glaubte, dass wir auf einer bekannten Grundlage - n&auml;mlich der
Informationstheorie - vollst&auml;ndig neue Schreibsysteme mit weniger
Hardware als Tastaturen erhalten k&ouml;nnen, die trotzdem beinahe so schnell
arbeiten - und dass sie in Zeigeysteme wie z.B. Eyetracker integriert werden
k&ouml;nnten.
<br>
<hr noshade size=1>
<dt>
<a NAME="q02"></a><b>F&uuml;r wen ist Dasher gedacht?</b></dt>

<br>&nbsp;
<p>Unterschiedliche Gruppen werden Dasher hilfreich finden. Ihr gemeinsames
Interesse ist, eine Alternative zur regul&auml;ren Zehnfingertastatur zu
finden.
<ul>Die Gruppe darunter sind&nbsp; <b>Palmtopcomputerbenutzer</b>, deren
Tastaturen nicht die vollen Abmessungen besitzen. Viele von denjenigen,
die sich die Pocket-PC-Version von Dasher heruntergeladenhaben, finden,
dass es leicht zu erlernen ist und Spa&szlig; macht.
<p>Diejenige Gruppe, f&uuml;r die Dasher unserer Ansicht nach die gr&ouml;&szlig;ten
Vorz&uuml;ge bietet, sind <b>Personen mit besonderen Bed&uuml;rfnissen</b>.
Viele von denen, die keine Tastatur bedienen, wohl aber eine normale Maus,
Joystick, Trackball, Touchscreen oder Kopfmaus (und nat&uuml;rlich nur
diejenigen, die ihren Bildschirm sehen k&ouml;nnen), werden Dasher hilfreich
finden. Innerhalb von 10 Minutenk&ouml;nnen diese Anwender mit Dasher 5
bis 15 W&ouml;rter pro Minute schreiben. Nach 60 Minuten &Uuml;bung betr&auml;gt
die Schreibgeschwindigkeit 15 bis 25 W&ouml;rter pro Minute. Mit noch mehr
&Uuml;bung kann man 39 W&ouml;rter pro Minute erreichen.
<p>F&uuml;r <b>Schwerbehinderte</b>, die mit den obengenannten Zeigesystemen
nicht umgehen k&ouml;nnen, wohl aber mit ihren eigenen Augebn, bietet Dasher
enorme Vorteile, wenn es zusammen mit einem <b>Eyetracker</b> verwendet
wird. Mit der entsprechenden &Uuml;bung k&ouml;nnen Schreibgeschwindigkeiten
von 20-25 W&ouml;rtern pro Minute erzielt werden.
<p>Eine weitere Gruppe, f&uuml;r die eine gew&ouml;hnliche "qwertz"-Tastatur
unpraktisch ist, sind Japanische Computerbenutzer. Viele von ihnen k&ouml;nnen
mit dem lateinischen Alfabet nicht umgehen. Es ist m&uuml;hsam, Japanisch
mit einer lateinischen Tastatur zu schreiben. Dasher kann in fast jeder
Sprache verwendet werden, und wir haben einen japanischen Prototyp entwickelt,
der mit dem phonetischen Hiragana-Alphabet schreiben kann.</ul>

<hr noshade size=1>
<dt>
<a NAME="q10"></a><b>Wie kamen Sie auf die Idee der Schnittstelle mit invers-arithmetischer
Codierung?</b></dt>

<p>Ich (David MacKay) sa&szlig; Dezember 1997 mit Mike Lewicki im Bus zum
Flughafen Denver. Ich gab gerade etwas in meinen Minicomputer ein (ein
Psion 3a mit einer kleinen "qwerty"-Tastatur), und Mike kommentierte: "Ei
der daus, wie gro&szlig; der Kasten doch ist!" Und nun dachten wir &uuml;ber
die Frage nach: "Wie k&ouml;nnten wir einen kleineren Minicomputer bauen,
vorausgesetzt die Tastatur sei der limitierende Faktor?" Unser Brainstorming
zur Schaffung eines Hilfsmittels mit einem niedlich kleinen Display m&uuml;ndete
in einer Brille und einem Eingabesystem nicht gr&ouml;&szlig;er als 2cm
mal 2cm, das am Jackenzipfel befestigt werden kann und nur mit dem Finger
bedient wird.
<p>Wir waren &uuml;berzeugt, etwas effizienteres als eine herk&ouml;mmliche
Tastatur zu machen. Aus zwei Gr&uuml;nden ist eine Tastatur ineffizient.
Erstens muss jeder Buchstabe durch eine eigene Fingerbewegung eingegeben
werden - aber ein normaler Text ist hochredundant und deshalb in hohem
Ma&szlig; vorhersehbar. Der Informationsgehalt eines normalen Texts betr&auml;gt
nur ein bis 2 Bits pro Buchstabe. Deshalb nahmen wir uns vor, ein Sprachmodell
in das Herzst&uuml;ck des Texteingabewerkzeugs zu integrieren, um diese
Vorhersehbarkeit besser auszunutzen und die Belastung des Anwenders zu
reduzieren. Zweitens: Der lateinische Ausdruck ''digitis" f&uuml;r den
menschlichen Finger wird heute zwar heute auch als ''digit'' verwendet,
aber die Finger sind und bleiben <i>analoge</i> Werkzeuge mit ihrer besonderen
F&auml;higkeit zu feinen, kontinuierlichen Gesten. Die groben, klumpigen
Tasten missachten unsere F&auml;higkeit, hochpr&auml;zise Bewegungen auszuf&uuml;hren.
Stattdessen zwingen sie uns zu bin&auml;ren Bewegungen, indem wir die Tasten
dr&uuml;cken m&uuml;ssen. Nach unserer Einsch&auml;tzung kann ein einzelner
Finger grunds&auml;tzlich Informationen mit einer Datenrate von circa 24
bit pro Sekunde anzeigen.
<p>Wenn wir einen einzigen Finger (der Informationen mit einer Rate von
24 bit pro Sekunde weitergibt), mit einem guten Sprachmodell verkn&uuml;pfen
k&ouml;nnten (das den Text zu einem Bit pro Buchstabenkomprimiert), dann
k&ouml;nnten wir vielleicht mit einer Geschwindigkeit von 24 Buchstaben
pro Sekunde schreiben!
<p>Hier hatte ich die Idee, einen invers-arithmetischen Codierer zu konstruieren.
<p>Der Anwender k&ouml;nnte die Schnittstelle durch zweidimensionale Zeichen
steuern, zum Beispiel auf einem 2D-Trackpad. Und weil der Anwender sieht,
wohin sich die Zeichen bewegen, brauchen wir nicht einmal den Trackpad:
Wir k&ouml;nnten genauso gut einen Eyetracker benutzen, um die gleiche
steuernde Information zu erhalten.
<p>Damit war die Idee von 'Dasher' geboren. (Den Namen hat Mike vorgeschlagen.)
Mike dachte sich, dass man einen Prototyp am besten in Tcl schreiben sollte,
und als wir am Flughafen Denver ankamen, hatte Mike mir gerade soviel Tcl
beigebracht, dass ich eine einfache zoomende Schnittstelle zusammengezimmert
hatte.
<p>Innerhalb einer Woche hatte ich den ersten Prototypen von 'Dasher' fertiggestellt.
<p>Noch eine weiteres Motiv hatte mich befl&uuml;gelt:&nbsp; Dasher ist
ein invers-arithmetischer Codierer - es w&uuml;rde ein praktisches <i>Lehrmittel</i>
abgeben, und zwar f&uuml;r arithmetische Codierung in meinem Fortgeschrittenenkurs
&uuml;ber <i>Informationstheorie, Mustererkennung und Neuronale Netze</i>.
Seit Januar 1998 habe ich alle Jahre wieder Dasher eingesetzt, um arithmetische
Codierung zu lehren.
<br>
<hr noshade size=1>
<dt>
<a NAME="q11"></a><b>Wie funktioniert die Texteingabe? K&ouml;nnen Sie
sie so beschreiben, dass ich sie mir bildhaft vorstellen kann?</b></dt>

<br>&nbsp;
<p>Mit Worten ist das schwer zu erkl&auml;ren -soger mit Bildern ist es
schwierig!
<font size=-1>(<a href="../Novice.html">Eine Online-Erkl&auml;rung
mit Bildern gibt es hier</a>)</font> Am einfachsten l&auml;sst es sich
mit einer Live-Vorf&uuml;hrung zeigen. Wie auch immer, versuchen wir's
mal:
<p>Stellen Sie sich eine <b>Bibliothek mit allen m&ouml;glichen B&uuml;chern</b>
vor. Alle B&uuml;cher seien auf einem einzigen Regalboden
<br>alfabetisch geordnet. (Ja genau, ich meine <i>alle</i> m&ouml;glichen
B&uuml;cher. Diese Bibliothek wird manchmal die Bibliothek von Babel gennannt.)
B&uuml;cher mit dem Anfangsbuchstaben "a" stehen links. B&uuml;cher mit
dem Anfangsbuchstaben "z" stehen
<br>rechts. Das erste Buch in Abschnitt "a" liest sich wie "aaaaaaaaaaaa...";
irgendwo rechts davon befinden sich B&uuml;cher, deren Titel mit "all good
things must come to an end..." beginnt; ein kleines bisschen weiter rechts
befinden sich B&uuml;cher, deren Titel mit "all good things must come to
an enema..." beginnt.
<p>Wenn jemand ein Textst&uuml;ck schreibt, dann wird er seinen n&auml;chsten
Textbaustein aus dieser "Bibliothek aller B&uuml;cher" ausw&auml;hlen
<br>- n&auml;mlich dasjenige Buch, das genau den zu w&auml;hlenden Textbaustein
enth&auml;lt. Wie wird dieses Buch angew&auml;hlt? Stellen wir uns
<br>einmal vor, es soll&nbsp;&nbsp; "all good things..."&nbsp;&nbsp; geschrieben
werden...
<p>Zuerst wandert unser Benutzer in den Abschnitt "a" der Bibliothek. Dort
wird er mit denjenigen B&uuml;chern konfrontiert, die mit
<br>"aa", "ab", "ac,.... "az" beginnen. Sobald er dem "al" - Abschnitt
n&auml;her r&uuml;ckt, kann er schon B&uuml;cher sehen, die
<br>mit "ala", "alb",... "alz" anfangen.
<p>Der Schreibende r&uuml;ckt dem Regal immer n&auml;her und wird das Buch
finden, das genau den Text enth&auml;lt, den er schreiben wollte.
<br>Anstelle von "Schreiben" k&ouml;nnen wir den Vorgang beschreiben als
<b>Hineinzoomen
in eine alfabetische Bibliothek, indem</b>
<br><b>wir in die richtige Richtung gehen</b>.
<p>Genauso funktioniert Dasher, mit einer t&uuml;ckischen Ausnahme: Wir
&auml;ndern die GR&Ouml;SSE der Stellfl&auml;che f&uuml;r jedes Buch entsprechend
der <b>Wahrscheinlichkeit</b> des zugeh&ouml;rigen Texts. Beispielsweise
werden nicht viele B&uuml;cher mit "x" beginnen. Deshalb k&ouml;nnen wir
"x..." weniger Platz zur Verf&uuml;gung stellen - daf&uuml;r gibt es mehr
Platz f&uuml;r die plausibleren B&uuml;cher, damit wir den wahrscheinlichen
Text leichter finden.
<p>Im Endeffekt haben wir nicht das Gef&uuml;hl, wie bei der Schreibmaschine
nur einzelne Buchstaben zu schreiben - sondern es kommt uns Anwendern so
vor, wie wenn uns ganze Silben, ganze W&ouml;rter, ja sogar ganze S&auml;tze
entgegeneilten.
<p>Der Anwender steuert sein Schreiben, indem er in die Richtung zeigt,
in die er gehen will. Die Anzeige zoomt weiter in die von ihm angedeutete
Richtung. Und weil jeder Anwender typischerweise in die Richtung <b>schaut</b>,
die er einschlagen will, ist es nicht einmal notwendig dorthin zu zeigen
- wir k&ouml;nnen einfach seine Augen verfolgen und die Blickrichtung als
Zeiger nutzen.
<br>
<hr noshade size=1>
<dt>
<a NAME="q12"></a><b>Wie funktioniert arithmetrische Codierung? K&ouml;nnen
Sie sie so beschreiben, dass ich sie mir bildhaft vorstellen kann?</b></dt>

<br>&nbsp;
<p>Arithmetische Codierung ist eine herrliche Methode zur Textkompression.
Normalerweise brauche ich zur Erkl&auml;rung eine&nbsp; Vorlesungseinheit.
<p>Stellen Sie sich ein Lineal&nbsp; vor, z.B. mit 30 cm L&auml;nge. Markieren
Sie es auf halber L&auml;nge. Markieren Sie die linke H&auml;lfte "0" und
die rechte H&auml;lfte "1". Nun halbieren Sie die linke H&auml;lfte und
markieren die zwei Viertel "00" and "01". Genauso halbieren Sie die rechte
H&auml;lfte und markieren die zwei Viertel "10" and "11". Jetzt haben wir
sechs Intervallbezeichnungen vergeben: "0" und "1" sowie&nbsp; "00", "01",
"10", und "11". Die letzten vier Intervalle k&ouml;nnen wir weiter unterteilen
und bekommen acht Intervalle wie: "000" and "101" usw.&nbsp;&nbsp; Es kann
also ein beliebiger Abschnitt (und ein beliebig kleiner Abschnitt!) mit
einer bin&auml;ren Zeichenfolge assoziiert werden.
<p>Nun h&auml;ngt die Textkompression nat&uuml;rlich davon ab, ob der Text
Redundanzen enth&auml;lt, und eine beliebige Redundanz kann mit einem probabilistischen
Modell beschrieben werden, welches uns sagt, welcher Buchstabe in dem Dokument
<i>wahrscheinlich</i>
der erste ist, und welcher <i>wahrscheinlich</i> der zweite ist (unter
der Voraussetzung, der wahrscheinlichste erste sei es wirklich!) usw.&nbsp;
Arithmetische Codierung geht von der Annahme aus, dass Sie irgendwoher
solch ein Modell haben.
<p>Wenden wir uns mal der Vorhersagen des probabilistischen Modells zu:
Nehmen wir mal an, die vorhergsagten Wahrscheinlichkeiten f&uuml;r den
ersten Buchstaben&nbsp;&nbsp; (a,b,c,...., oder z)&nbsp;&nbsp; seien P(a)=0.05;
P(b)=0.02; P(c)=0.03; ... P(e)=0.10; ... P(t)=0.20; ....
<p>Wir k&ouml;nnen diese Wahrscheinlichkeiten nutzen, um das Lineal in
St&uuml;ckchen zu teilen. Die 5% ganz links auf dem Lineal nennen wir "a",
die n&auml;chsten 2% nennen wir "b" usw.
<p>Danach k&ouml;nnen wir die "a"-Portion des Lineals in "aa", "ab", "ac",...&nbsp;
unterteilen, jeweils entsprechend den einzelnen Wahrscheinlichkeiten, die
von dem probabilistischen Modell zugeordnet werden, sobald wir die Frage
stellen: ''Angenommen der erste Buchstabe sei ein "A", welcher Buchstabe
wird wahrscheinlich der zweite sein?''
<p>So wird jede m&ouml;gliche Zeichenfolge einem kleinen Abschnitt des
Lineals zugeordnet. Danach codiert die arithmetische Codierungsmethode
einfach die gegebene Zeichenfolge, indem sie k&uuml;rzeste <i>bin&auml;re</i>
Zeichenfolge findet, die demselben St&uuml;ck des Lineals entspricht.
<br>
<hr noshade size=1>
<dt>
<a NAME="q13"></a><b>Wie passt sich das Modell der Sprache des Schreibenden
an?</b></dt>

<dd>
Wir verwenden ein Sprachmodell namens PPM (prediction by partial match,
dt.: Vorhersage durch teilweise &Uuml;bereistimmung). Dieses Sprachmodell
erzeugt seine Vorhersagen, indem es z&auml;hlt, wie oft jeder Buchstabe
im Trainingstext in einer &auml;hnlichen Zusammenstellung vorkam. Das Modell
kann leicht adaptiert werden durch beliebige Eingaben des Anwenders in
die &Uuml;bungstextdatenbank. Es funktioniert mit fast jeder Sprache.</dd>

<br>
<hr noshade size=1>
<dt>
<a NAME="q14"></a><b>Wie sehr erm&uuml;den die Augen bei dieser Methode?</b></dt>

<br>&nbsp;
<p>Eine benutzerfreundlichere Methode, als mit den eigenen Augen zu schreiben,
k&ouml;nnen wir uns nicht vorstellen. &Auml;hnlich wie beim Autofahren
verbringen Ihre Augen viel Zeit damit, dahin zu schauen, wohin Sie fahren.
Wir k&ouml;nnen uns deshalb grunds&auml;tzlich vorstellen, uns des Steuerrads
zu entledigen und das Auto einfach dahin fahren zu lassen, wohin Ihre Augen
gerade schauen. Diese freih&auml;ndige Art zu fahren w&auml;re f&uuml;r
die Augen des Fahrers &uuml;berhaupt nicht anstrengender als das normale
Fahren.
<p>Ein &auml;hnliches Gef&uuml;hl hat man beim Schreiben mit Dasher. Es
geht fast m&uuml;helos. Schauen Sie einfach auf dem Bildschirm nach der
ersten Silbe, die Sie schreiben wollten: sie zoomt an Ihnen vorbei, und
die n&auml;chsten m&ouml;glichen Silben erscheinen; meistens k&ouml;nnen
Sie die n&auml;chste von Ihnen gew&uuml;nschte Silbe leicht ausmachen.
Sie fixieren die Silbe, sie zoomt herbei, und die n&auml;chsten Optionen
erscheinen. Es wird keine bewusste Kontrolle der Augen ben&ouml;tigt.
<p>Die Benutzung billiger und einfacher Eyetracker kann bei jeder Anwendung
erm&uuml;dend sein, weil solche Eyetracker leicht von einem blinkenden
Auge gest&ouml;rt werden oder schlecht kalibriert sind. Diese Probleme
beruhen aber nicht auf Dasher, sondern auf dem Eyetracker.
<br>
<hr noshade size=1>
<dt>
<a NAME="q15"></a><b>Wie schnell ist Ihre Methode im Vergleich zu anderen
Texteingabemethoden?</b></dt>

<br>&nbsp;
<p>In unserer Publikation, <a href="/mackay/abstracts/eyeshortpaper.html">"Schnelles
freih&auml;ndiges Schreiben mit dem Blick"</a>,&nbsp; in <i>Nature</i>
vom 22. August 2002 vergleichen wir&nbsp; einen Eyetracker mit Bildschirmtastatur
mit Dasher, dessen Worterg&auml;nzung &uuml;ber einen Eyetracker gesteuert
wird. Dasher-Anwender konnten nach einer &Uuml;bungsdauer von einer Stunde
bis zu <b>25 W&ouml;rtern pro Minute</b> schreiben. Die Benutzer der Bildschirmtastatur
konnten nach der gleichen &Uuml;bungszeit nur <i>15 W&ouml;rter pro Minute</i>
schreiben. Au&szlig;erdem betrug die <b>Fehlerrate</b> bei der Benutzung
der auf dem Bildschirm angezeigten Tastatur ungef&auml;hr dasd <i>F&uuml;nffache</i>
derer von Dasher. Es ist schwierig, unter Dasher Buchstabierfehler zu machen,
weil das Sprachmodell die Auswahl korrekter Schreibweisen erleichtert.
<p>Zu Geschwindigkeit und Fehlerrate noch weitere wichtige Faktoren hinzu.
Anwender, die beide Systeme ausprobiert hatten, berichteten, dass sie die
Bildschirmtastaturaus zwei Gr&uuml;nden anstrengender fanden: Erstens ist
man sich unsicher, ob im aktuellen Wort ein Fehler vorliegt (die Erg&auml;nzungsautomatik
funktioniert nur, wenn keine Fehler gemacht wurden), denn ein Fehler kann
nur erkannt werden, wenn man <i>nicht</i> auf die Tastatur schaut. Zweitens
muss man bei jedem Buchstaben entscheiden, ob man die Worterg&auml;nzung
verwenden oder weiterschreiben soll. Nach dem Worterg&auml;nzungsfenster
zu schauen ist wie ein&nbsp; G&uuml;cksspiel, denn man kann sich nicht
sicher sein, ob das ben&ouml;tigte Wort dort wirklich angezeigt wird. Selbst
wenn es angezeigt wird - es ist zus&auml;tzliche mentale Aktivit&auml;t
f&uuml;r das Suchen und Finden der richtigen Erg&auml;nzung n&ouml;tig.
<p>Demgegen&uuml;ber sehen die Anwender von Dasher gleichzeitig die zuletzt
geschriebenen Buchstaben <i>und</i> die wahrscheinlichsten Optionen f&uuml;r
die n&auml;chsten. Und es ist Dasher egal, wie Sie schreiben wollen - es
braucht nicht zu unterscheiden zwischen Worterg&auml;nzung und normalem
Schreiben.
<p>Auch haben wir das <b>mausgesteuerte</b> Dasher mit anderen Zeigeger&auml;t-basierten
Texteingabesystemen verglichen. Alle Anwender werden mit der &Uuml;bung
schneller, und die Schreibgeschwindigkeiten der sehr Erfahrenen haben mit
der Maus <b>39 W&ouml;rter pro Minute</b> erreicht. Das ist noch nicht
so schnell wie die Geschwindigkeit mit dem Zehnfingersystem auf einer voll
dimensionierten Tastatur, aber wir sind weder auf eine Tastatur mit Platzbedarf
angewiesen noch auf die zwei H&auml;nde, mit denen wir sie bedienen m&uuml;ssten.
<i>Wir</i>
brauchen nur einen Finger!
<br>
<hr noshade size=1>
<dt>
<a NAME="q15a"></a><b>Wie lange braucht man, um mit Dasher englisch Schreiben
zu lernen?</b></dt>

<br>&nbsp;
<p>Wir k&ouml;nnen zur mausgesteuerten Version von Dasher und zur Eyetrackerversion
n&auml;here Angaben machen.
<ul>
<li>
Mit der <b>Maussteuerung</b>: Innerhalb 10 Minuten k&ouml;nnen Dasher-Neulinge
auf Englisch mit 5 bis 15 W&ouml;rtern pro Minute schreiben. Nach 60 Minuten
&Uuml;bung rangieren die Schreibgeschwindigkeiten bei 15 bis 25 W&ouml;rtern
pro Minute. Unser erfahrenster Dasheranwender, David Ward, schreibt mit
39 W&ouml;rtern pro Minute.
<a href="http://www.inference.phy.cam.ac.uk/djw30/dasher/exp.html)">(Einige
experimentelle Ergebnisse k&ouml;nnen Sie hier online abrufen)</a></li>

<li>
<b>Mit dem Eyetracker</b> k&ouml;nnen Neulinge auf Englisch nach 10 Minuten
mit 7 W&ouml;rtern pro Minute schreiben und nach 60 Munuten &Uuml;bung
mit 12-15 W&ouml;rtern pro Minute. Erfahrenere Dasher-Anwender k&ouml;nnen
20-25 W&ouml;rter pro Minute schreiben.</li>
</ul>

<hr noshade size=1>
<li>
<a NAME="q16"></a><b>K&ouml;nnen Sie eine Person beschreiben, die sowohl
einige S&auml;tze mit Ihrer Methode als auch mit einer Bildschirmtastatur
geschrieben hat?</b></li>

<br>&nbsp;
<p>Mit einer normalen bildschirmabgebildeten Tastatur m&uuml;ssen Sie den
ersten zu schreibenden Buchstaben eine vorgegebene Zeit lang anschauen
(diese sogenannte ''Verweilzeit - engl: dwell time'' ist im Sinne einer
Reaktionszeit Ihres Computers voreingestellt - zum Beispiel auf eine halbe
Sekunde). Danach schauen Sie auf den n&auml;chsten Buchstaben usw.&nbsp;
Das ist f&uuml;rchterlich langsam und erm&uuml;dend. Das Ziel der Evolution
unserer Augen war nicht das ''Kn&ouml;pfchendr&uuml;cken''!&nbsp; Wenn
Sie die Reaktionszeit verringern, haben Sie immer noch das Gef&uuml;hl
der Langsamkeit und Erm&uuml;dung, aber nicht mehr so schlimm wie bei der
ersten Einstellung. Nun aber f&uuml;hrt die verringerte Reaktionszeit zu
Fehlern, weil Sie versehentlich bei den falschen Tasten ''verweilen''.
Zur Beschleunigung Ihres Schreibvorgangs haben Sie die Option, einige wenige
Sondertasten am oberen Rand der Tastatur anzuschauen. Diese bieten Ihnen
Worterg&auml;nzungen an. Weil Sie nur das lesen k&ouml;nnen, was Sie gerade
anschauen, werden Sie die angebotenen Worterg&auml;nzungen nur herausfinden,
indem Sie sich dazu entschlie&szlig;en, Ihren Blick auf das Worterg&auml;nzungsareal
zu richten. Dieses tasten Sie mit Ihrem Blick ab, w&auml;hrend Sie gleichzeitig
versuchen, auf keinem der angezeigten W&ouml;rter zu lange zu verweilen.
Entweder m&uuml;ssen Sie jetzt das richtige Wort durch anschauen anw&auml;hlen
(wenn Sie es denn finden) oder aufgeben zum Tastatur zur&uuml;ckkehren.
Sofern Sie zum Tastaturschreiben zur&uuml;ckkehren, sollten Sie sich jetzt
erinnern, bei welchem Buchstaben Ihr Schriftzug schon angelangt war! Den
zuletzt geschriebenen Buchstaben k&ouml;nnen Sie sich nur in Erinnerung
bringen, wenn Sie auf wieder ein anderes Bildschirmfeld schauen. Die Worterg&auml;nzung
ist hier weniger wertvoll, da sie nicht wei&szlig;, wann Ihren Augen ein
Tippfehler unterlaufen ist. Es l&auml;st sich wohl nicht vermeiden, dass
sie einige W&ouml;rter in Ihrem Satz falsch buchstabiert haben.
<p>Wenn Sie f&uuml;r den gleichen Satz Dasher einsetzen, zeigt der Eingangsbildschirm
alle Schriftzeichen von a bis z vertikal an. Sobald sie auf den ersten
Buchstaben des Satzes blicken, zoomt die Anzeige in dieses Schriftzeichen
hinein. In diesem ersten Buchstaben erscheinen die m&ouml;glichen Fortsetzungen.
Sie blicken Sie auf die Fortsetzung, die Sie wollen, und die Anzeige zoomt
dorthinein. Es handelt sich um einen kontinuierlichen Vorgang. Es gibt
keine abgestuften Auswahlstadien. Nur wenig links von der Stelle, auf die
man gerade blickt, sieht man die bereits augew&auml;hlte Zeichenfolge.
Rechts kann man sehen, wie es wahrscheinlich weitergehen wird - geordnet
in alfabetischer Reihenfolge. Sie haben das Gef&uuml;hl, Worterg&auml;nzungen
angeboten zu bekommen. Gleichzeitig tun Sie nichts anderes als zu schreiben,
indem Sie Buchstaben aus dem Alfabet aussuchen. Fehler werden seltener;
wenn Sie Dasher etwa eine Stunde lang ge&uuml;bt haben. Wenn Sie einmal
einen Fehler gemacht haben, merken Sie es typischerweise gleich danach,
weil das Modell dann die von Ihnen anschlie&szlig;end gew&uuml;nschten
Zeichen nicht mehr richtig vorhersagt. Sie korrigieren die Fehler, indem
Sie zur&uuml;ckgehen -- blicken Sie auf die linke Seite des Bildschirms
statt
nach rechts -- danach blicken Sie wieder allm&auml;hlich nach rechts.
<br>
<hr noshade size=1>
<dt>
<a NAME="q17"></a><b>Welche technischen Hindernisse waren zu &uuml;berwinden,
damit Dasher funktioniert?</b></dt>

<br>&nbsp;
<li>
David Ward verdanken wir die Schwerarbeit, den&nbsp; Prototypen in eine
schnelle, brauchbare, effektive und sch&ouml;ne Software zu &uuml;berf&uuml;hren
und sie zu pr&uuml;fen. Besonders wichtige Beitr&auml;ge waren Nichtlinearit&auml;ten
in der Darstellung des Bildes und Nichtlinearit&auml;ten in der Dasher
eigenen Dynamik. Nachdem die urspr&uuml;ngliche lineare Version schon ganz
ordentlich funktionierte, schaffte es David, die Schreibgeschwindigkeit
wesentlich zu erh&ouml;hen, indem er klug Nichtlinearit&auml;ten einf&uuml;hrte.</li>

<br>Die Schwachstelle in der Eyetrackerversion von Dasher ist die Aufl&ouml;sung
des Eyetrackers.
<hr noshade size=1>
<dt>
<a NAME="q18"></a><b>Was war an den Ergebnissen &uuml;berraschend?</b></dt>

<br>&nbsp;
<p>Wir waren hocherfreut dar&uuml;ber, dass man mit Dasher und einem Eyetracker
viel schneller schreiben kann, als es uns von vielen behinderten Anwendern
mit anderen Programmen berichtet wurde. Wir haben von einem Anwender erfahren,
der nur 6-9 W&ouml;rter pro Minute schreiben konnte. Hoffentlich versucht
er es mal mit Dasher. Wahrscheinlich&nbsp; wird seine Schreibgeschwindigkeit
damit verdreifacht.
<br>
<hr noshade size=1>
<dt>
<a NAME="q18b"></a><b>Sie behaupten, Dasher verursache weniger Buchstabierfehler
als Standardmethoden. Aber -&nbsp; wie ernsthaft wurden die Fehler ausgewertet
und verglichen? Ein Buchstabierfehler wird vom Leser leicht erkannt. Ein
anderes Wort, das tweilweise zuf&auml;llig ausgew&auml;hlt wurde, kann
die ganze Bedeutung ver&auml;ndern. Haben Sie diesen qualitativen Gesichtspunkt
gr&uuml;ndlich untersucht?</b></dt>

<br>&nbsp;
<p>Eine gute Frage. Wir haben diesen Gesichtspunkt noch nicht einer formalen&nbsp;
Untersuchung unterzogen, aber ich kann Ihnen einige Rohdaten &uuml;berlassen
und Ihnen einen vorl&auml;ufigen Eindruck geben. Ich glaube, dass die meisten
Fehlbuchstabierungen der hier folgenden Textprobe nicht schwer wiegen und
dass viele von Ihnen aus Unsicherheit entstanden sind, wie man Jane Austens
Prosa &uuml;berhaupt buchstabieren soll!
<br>Den hier gezeigten Text schrieb ich in meiner neunten Sitzung mit dem
Eyetracker. Er angeblich 5 Fehler im Vergleich mit der Vorlage. [Interpunktion
und Gro&szlig;buchstaben wurden damals grunds&auml;tzlich nicht ber&uuml;cksichtigt
mit der Ausnahme, dass die Satzenden mit doppeltem Unterstrich '__' gekennzeichnet
wurden.]
<pre>thewoodhouses_were_first_in_consequence_there__all_looked_up_to_them__she_had_ma
ny_acquaintance_in_the_place_for_her_father_was_universally_civil_but_not_one_am
ong_them_who_could_be_accepted_in_lieu_of_miss_taylor_for_even_half_a_day__it_wa
s_a_melancholy_change__and_emma_could_not_but_sigh_over_it_and_wish_for_impossib
le_things_till_her_father_awoke_and_made_it_ncessary_to_be_cheerful__his_spirits
_required_support__he_was_a_nervous_man_easily_depressed__fond_of_every_body_tha
t_he_was_used_to_and_hating_to_part_with_them__hating_change_of_every_kind__</pre>
Der korrigierte Text (Fehler wurden gekennzeichnet mit *) war folgender:
<pre>The*Woodhouses were first in consequence there.&nbsp; All looked up to
them.&nbsp; She had many acquaintance in the place, for her father was
universally civil, but not one among them who could be accepted in
lieu of Miss Taylor for even half a day.&nbsp; It was a melancholy change;
and Emma could not but sigh over it, and wish for impossible things,
till her father awoke, and made it n*ecessary to be cheerful.&nbsp; His
spirits required support.&nbsp; He was a nervous man, easily depressed;
fond of every body that he was used to, and hating to part with them;
hating change of every kind.</pre>
Das folgende Beispiel zeigt zwei geringf&uuml;gige Fehler. Die anderen
drei kann ich nicht finden! Schauen wir uns ein anderes Beispiel an, Versuch
14. (Angeblich 4 Fehler)
<pre>the_real_evils_indeed_of_emmas_situation_were_the_power_of_having_rat
her_too_much_her_own_way_and_a_disposition_to_think_a_little_too_well
_of_herself__these_were_the_disadvantages_which_threatened_alloy_to_h
er_many_enjoyments__the_danger_however_was_at_present_so_unperceived_
that_they_did_not_by_any_means_rank_as_misfortunes__sorrow_came_a_gen
tle_sorrow_but_not_at_all_in_the_shape_of_any_disagreeable_consciousn
ess__miss_taylor_married__it_was_miss_taylors_loss_which_first_brough
t_grief__it_was_on_the_wedding_day_of_this_beloved_friend_that_emma_f
irst_sat_in_mour</pre>

<pre>The real evils, indeed, of Emma's situation were the power of having
rather too much her own way, and a disposition to think a little too
well of herself; these were the disadvantages which threatened alloy
to her many enjoyments.&nbsp; The danger, however, was at present so
unperceived, that they did not by any means rank as misfortunes *with*
*her*.&nbsp; Sorrow came -- a gentle sorrow -- but not at all in the shape of
any disagreeable consciousness.-- Miss Taylor married.&nbsp; It was Miss
Taylor's loss which first brought grief.&nbsp; It was on the wedding-day of
this beloved friend that Emma first sat in mournful thought of any
continuance.</pre>
In diesem Beispiel kann ich wiederum nur 2 Fehler finden (die beiden ausgelassenen
W&ouml;rter). Ich hoffe, dass diese Beispiele ausreichen um aufzuzeigen
wie zuverl&auml;ssig Dasher ist, sobald man etwas ge&uuml;bter ist. Es
ist schwierig Fehler zu machen, weil man immer sehen kann, was man gerade
geschrieben hat. Deshalb glaube ich, dass man ein falsch geschriebenes
Wort erkennen w&uuml;rde.&nbsp;
<hr noshade size=1>
<dt>
<a NAME="q18c"></a><b>F&uuml;nfundzwanzig W&ouml;rter pro Minute zu schreiben
ist immer noch langsamer als zu sprechen. Warum w&uuml;rde jemand Dasher
verwenden, wenn er stattdessen eine Spracherkennung benutzen k&ouml;nnte?</b></dt>

<br>&nbsp;
<br>&nbsp;
<p>Dasher kann mit jeder normalen Maus, mit einer Touchscreen oder mit
einem Eyetracker verwendet werden. Die &uuml;berwiegende Mehrheit der Dasheranwender
verwendet die normale Maus oder eine Touchscreen. Mit Maus oder Touchscreen
k&ouml;nnen bei entsprechender &Uuml;bung 35 W&ouml;rter pro Minute erreicht
werden. Nach einer Stunde &Uuml;bung sind 25 W&ouml;rter pro Minute ein
typischer Wert.
<p>Das ist tats&auml;chlich langsamer als die Sprechgeschwindigkeit. Steht
jemandem die Spracherkennung zur Verf&uuml;gung, so sieht er vielleicht
keine Notwendigkeit, Dasher zu verwenden.
<p>Dennoch m&ouml;gen manche Menschen Dasher, weil ...
<ol>
<li>
es ihnen erm&ouml;glicht, leise zu schreiben - klappernde Tasten gibt es
nicht mehr!</li>

<li>
manche Menschen die Spracherkennung einfach nicht zum Laufen bringen k&ouml;nnen.</li>

<li>
Sie Dasher auf jedem Computer einsetzen k&ouml;nnen, wohingegen Sie die
Spracherkennung nur auf einem Computer verwenden k&ouml;nnen, der mit Ihrer
Stimme trainiert wurde.</li>

<li>
Umgebungsger&auml;usche eine Spracherkennung unm&ouml;glich machen.</li>

<li>
Spracherkennung ein Kopfmikrofon erfordert und den Anwender zwingt, sich
eine Menge neuer Fertigkeiten anzueignen -- Sie werden wahrscheinlich mehrere
Tage brauchen, ein Spracherkennungssystem zu bedienen. Dagegen werden Sie
mit Dasher innerhalb von 5 Minuten klarkommen, und eine Stunde reicht bestimmt
aus, um 25 W&ouml;rter pro Minute zu erzielen.</li>

<li>
Dasher kann bereits auf einem niedlichen Taschen-PC eingesetzt werden,
also auch dort, wo ein Spracherkennungssystem nicht mehr funktionieren
w&uuml;rde.</li>

<li>
Ein erfahrener Dasher-Anwender macht fast keine Fehler mehr. Selbst der
am besten geschulte Spracherkennungsanwender mit der deutlichsten Aussprache
wird feststellen, dass das System etwa 5% der W&ouml;rter falsch schreibt.</li>
</ol>

<hr noshade size=1>
<dt>
<a NAME="q18a"></a><b>Wieviel Rechenleistung ben&ouml;tigt Dasher?</b></dt>

<br>&nbsp;
<br>&nbsp;
<p>Dasher kann problemlos auf jedem herk&ouml;mmlichen PC betrieben werden
(unter den Betriebssystemen Windows oder GNU/Linux). Es funktioniert auch
sehr gut auf den leistungsf&auml;higeren Palmtopcomputern wie dem Pocket-PC.
Die Eyetrackerversion haben wir bisher nur auf Standard-PCs eingesetzt,
da uns noch kein Palmtop mit einem Eyetracker begegnet ist :-)
<br>
<hr noshade size=1>
<dt>
<a NAME="q19"></a><b>Wie f&uuml;gt sich Ihr Werk in die Arbeitsumgebung
von Textkompression, Texteingabe und die Mensch-Computer-Wechselwirkung
ein - und wo liegen die Unterschiede?</b></dt>

<br>&nbsp;
<br>&nbsp;
<p>Dasher besitzt ein ausgepr&auml;gtes Unterscheidungsverm&ouml;gen, weil
es auf die kontinuierlichen Bewegungen des menschlichen&nbsp;&nbsp; K&ouml;rpers
zur&uuml;ckgreift, statt den Menschen dazu zu zwingen, bin&auml;re Bewegungen
(wie beim Tippen) oder diskrete Zeichen oder Symbole auszusenden (wie mit
der Handschrift oder bei den ''Grafitti''). Die St&auml;rke der Augen liegt
im Navigieren und Suchen, und genau das sind die Fertigkeiten, auf welche
die Eyetrackerversion von Dasher zur&uuml;ckgreift.
<p>Dasher ist auch in der Lage, Unterschiede zu erkennen, weil es ein Sprachmodell
integriert, und zwar weit gehend frei von programmbediungten Einschr&auml;nkungen
(n&auml;mlich frei von Programm-Modi wie -Einstellungen oder -Varianten).
Viele Schreibsysteme verwenden ein Sprachmodell, um Worterg&auml;nzungen
vorzuschlagen, aber die Annahme eines Vorschlags bedingt eine &Auml;nderung
des Programmmodus. Wir halten den Einsatz von Dasher deshalb f&uuml;r besonders
einfach, weil es von Ihnen keine Entscheidungen zur &Auml;nderung des Modus
verlangt.
<p>Dasher erkennt die Unterschiede selbst und verlangt wenig Einarbeitung.
Sobald der Anwender sich an die alfabetische Reihenfolge auf dem Bildschirm
gew&ouml;hnt hat, ben&ouml;tigt er als einzige zus&auml;tzliche Fertigkeit
noch die F&auml;higkeit zu steuern – analog dem Steuern eines Autos. Diese
Fertigkeit kann &uuml;bernommen und &uuml;bertragen werden.&nbsp; M&ouml;chte
ein erfahrener Dasheranwender statt Englisch oder Deutsch Hiragana schreiben
(das Japanische Phonetische Alphabet), so kann er es sofort. Wir m&uuml;ssen
das Sprachmodell blo&szlig; noch an Hiragana gew&ouml;hnen und die richtigen
Schriftzeichen laden. Ein Anwender, der auf Englisch 25 W&ouml;rter pro
Minute schreibt, wird auch 25 W&ouml;rter pro Minute auf Japanisch schreiben
(unter der Annahme, dass er beide Sprachen beherrscht!). In &auml;hnlicher
Weise k&ouml;nnen wir im Englischen oder Deutschen weitere Schriftzeichen
zum Dasheralfabet hinzuf&uuml;gen (zum Beispiel Go&szlig;buchstaben neben
Kleinbuchstaben). Damit kann der Anwender immer noch genauso schnell wie
vorher schreiben, obwohl die Anzahl der verf&uuml;gbaren Schriftzeichen
sich verdoppelt hat. Sonderzeichen europ&auml;ischer Sprachen k&ouml;nnen
einfach eingef&uuml;gt werden. Um zehn akzentuierte Schriftzeichen in das
Alfabet einzuf&uuml;gen, sind keine gro&szlig;en &Auml;nderungen n&ouml;tig
im Unterschied zu anderen Schreibhilfen wie z.B. einer Tastatur.
<p>Dasher verwendet den &Uuml;bungstext um Unterscheidungen zu treffen.
Viele Sprachmodell-basierte Systeme gehen von der Annahme aus, dass die
Sprache aus W&ouml;rtern bestehe. Die Vorhersagen des Modells werden duch
Worterg&auml;nzungen verk&ouml;rpert. Unser Sprachmodell ben&ouml;tigt
diese Annahme nicht, aber es verh&auml;lt sich oft wie ein Worterg&auml;nzungssystem.
Au&szlig;erdem leistet Dasher oft gute Arbeit, indem es das n&auml;chste
Wort voraussagt. Dabei hat Dasher &uuml;berhaupt keine Vorstellung von
"W&ouml;rtern". Falls der Anwender Dokumente schriebe, in denen Leerzeichen
ausgelassen oder durch "X" ersetzt w&auml;ren, so w&uuml;rde das Sprachmodell
gut funktionieren; wenn der Anwender ganze S&auml;tze verwendet, wird Dasher
sich wie ein Satzerg&auml;nzungshilfsmittel verhalten.
<p>Dasher kann sofort pers&ouml;nlich gepr&auml;gt werden: Trainieren Sie
das Sprachmodell einfach mit einigen Beispieldokumenten, die dem &auml;hneln,
das Sie schreiben m&ouml;chten.
<p>Dasher funktioniert sofort und in jeder Sprache: Trainieren Sie das
Sprachmodell einfach mit Beispieldokumenten aus der gew&uuml;nschten Sprache.
<p>
<hr noshade size=1>
<dt>
<a NAME="q20"></a><b>Wie k&ouml;nnten diese Forschungsergebnisse praktisch
angewendet werden? Welche anderen Anwendungen k&ouml;nnten noch aus dieser
effizienten Textkompressionsmethode hervorgehen?</b></dt>

<br>&nbsp;
<br>&nbsp;
<p>Wir glauben, dass Dasher in mindestens drei Gruppen verwendet werden
kann und dass die von David Ward geschaffene Software f&uuml;r die Anwendung
in einer von ihnen so gut wie ausgereift ist.
<p>Zuallererst die Gruppe der Behinderten: Denjenigen, die eine qwerty/
qwertz-Tastatur nicht bedienen k&ouml;nnen, bietet Dasher eine M&ouml;glichkeit,
Text in einen Computer einzugeben. Einige behinderte Computeranwender,
die Dasher ausgiebig getestet haben, berichten uns, dass sie Dasher bei
Weitem besser finden als jede andere von ihnen ausprobierte Texteingabe.
Wir erwarten, dass Dasher, gesteuert &uuml;ber Touchpad, Joystick, Maus,
Kopfmaus, Rollierball oder
<br>Eyetracker, die Schreibgeschwindigkeit vieler behinderter Anwender
schlagartig verbessern wird.
<p>Zweitens bietet Dasher den Computeranwendern in extremer Umgebung eine
neuartige tastaturfreie Texteingabemethode. Bis heute haben kopfmontierte
Anzeigen f&uuml;r tragbare Kleincomputer kaum Bedeutung erlangt - wir meinen,
weil eine angemessene Texteingabemethode fehlte. Gesteuert durch einen
Eyetracker oder einen Miniaturtrackpad bietet Dasher eine neuartige L&ouml;sung
dieses Problems. Wir haben eine Dasher-Version entwickelt, die auf einem
Taschen-PC lauff&auml;hig ist. Vielleicht werden deshalb einige Palmtop-Anwender
Dasher als Texteingabe bevorzugen.
<p>Drittens glauben Wir, dass Dasher f&uuml;r japanische Computeranwender
besonders brauchbar sein wird. Viele japanische Anwender sind mit dem qwertz-Alphabet
nur wenig vertraut. Dennoch sind die meisten Computer in Japan mit qwertz-Tastaturen
best&uuml;ckt; daher kann man Japanisch auf einer Tastatur bisher nur relativ
langsam schreiben. Beim Schreiben auf Japanisch kann man mit Dasher die
qwerty-Tastatur umgehen. Gegenw&auml;rtig befindet sich der Hiragana-Prototyp
bei uns im Test.
<p>Andere spekulativere Anwendungen f&uuml;r Dasher:
<dl><b>Hybridsystem Voice-Dasher</b>
<dd>
Sprechen Sie in eine fehlerhafte Spracherkennung hinein und beobachten
Sie, wie ihre Folgerungen als Voraussagen angezeigt werden; &uuml;berall
wo das von Ihnen Gesagte nicht sicher erkannt wurde, verwenden Sie Dasher,
um in den richtigen Satz hineinzusteuern. Das ist viel einfacher, als Fehler
mit weiteren gesprochenen Befehlen zu korrigieren!</dd>

<br>
<hr noshade size=1>
<dt>
<b>Hybrides&nbsp; automatisches Dasher-&Uuml;bersetzungssystem</b></dt>

<dd>
Stellen wir uns ein leistungsschwaches &Uuml;bersetzungssystem vor, das
schlechte &Uuml;bersetzungen aus dem Franz&ouml;sichen oder Deutschen ins
Englische liefert. Jemand vom Fach muss durch die &Uuml;bersetzung hindurchstreifen
und Fehler korrigieren. Diese Korrektur k&ouml;nnte innerhalb Dasher erledigt
werden, indem die korrigierte Ausgabe des &Uuml;bersetzers ein Sprachmodell
erzeugt.</dd>
</dl>

<hr noshade size=1>
<dt>
<a NAME="q21"></a><b>Welche Eingabe wird sich auf lange Sicht durchsetzen?</b></dt>

<br>&nbsp;
<br>&nbsp;
<p>Ich glaube, dass wir die lange Sicht schon direkt vor uns haben. Schon
jetzt benutzt einer unserer behinderten Freunde Dasher zum Schreiben von
Dokumenten. Wir befinden uns am Ausgangspunkt f&uuml;r die Produktentwicklung
im Sinne von Ausbietung und Werbung.
<br>
<hr noshade size=1>
<dt>
<a NAME="q21a"></a><b>Nach Ihren Angaben kann Dasher in den meisten Sprachen
eingesetzt werden. Wie wird es wohl Ihrer Erwartung nach im Japanischen
angewendet?</b></dt>

<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<p>Als ersten Schritt zu einer vollwertigen japanischen Version von Dasher,
die sowohl Kana als auch Kanji beherrscht, hat David Ward eine Hiragana-Version
namens "Daishoya" geschrieben. Sie ist verf&uuml;gbar als Windowsversion
1.6.3 von Dasher und in den GNU/Linux-Versionen 1.6.3 bis 1.6.8.
<br>Ein Beispiel, wie "Daishoya" verwendet wird, um&nbsp;<img SRC="/dasher/images/howareyouH.gif" ALT="howareyouH" height=17 width=109>
(hajime mashite) zu schreiben, kann eingesehen werden &uuml;ber&nbsp; <a href="http://www.inference.phy.cam.ac.uk/dasher/Languages.html">www.inference.phy.cam.ac.uk/dasher/Languages.html</a>.
<br>Die Konvertierung von Dasher zu Daishoya ist einfach: Wir ersetzen
das lateinische Alfabet (a..z)&nbsp; durch das Hiraganaalfabet&nbsp;<img SRC="/dasher/images/aiueo.gif" ALT="aiueo..." height=18 width=235>
(a,i,u,e,o,ka,ki,ku,ke,ko...). Wir ersetzen den englischen &Uuml;bungstext
durch ein Hiraganadokument. [Leider konnten wir noch kein umfangreiches
Dokument finden, das in reinem Hiragana geschrieben ist. Deshalb ist dieses
Sprachmodell noch nicht so gut trainiert wie wir es uns gew&uuml;nscht
h&auml;tten.]
<br>Mit Daishoya k&ouml;nnen Sie Hiragana-Texte ohne Tastatur schreiben.
<br>Auf lange Sicht k&ouml;nnen wir uns zwei Wege vorstellen, mit Daishoya
Kanji zu schreiben:
<ol>
<li>
Wir k&ouml;nnten ein Sonderzeichen zu unserem Zeichensatz hinzuf&uuml;gen
(z.B. das „Eingabe“-Zeichen&nbsp; ?&nbsp; in der japanischen Word-Version)
mit der Bedeutung "von Hiragana nach Kanji konvertieren", und mit einem
Sprachmodell vorhersagen,&nbsp; welche Kanji-Zeichen in dem gegebenen Zusammenhang
und f&uuml;r die gerade geschriebene Hiraganasequenz die wahrscheinlichsten
sind. Alle wahrscheinlichen Kanji-Zeichen w&uuml;rden in K&auml;stchen
angezeigt, deren Gr&ouml;&szlig;e zu Ihrer Wahrscheinlichkeit proportional
ist. Der Anwender w&uuml;rde in das gew&uuml;nschte Kanji-Zeichen hineinzoomen.</li>

<li>
Wir k&ouml;nnten eine neue Daishoya-Version erstellen, deren „alfabetische“
Symbole nicht Kana-, sondern Kanjizeichen sind – zum Beispiel einfache
Striche. Der Anwender w&uuml;rde jedes einzelne Kanji-Zeichen durch Hinzuf&uuml;gen
einzelner Elemente aufbauen.</li>
</ol>

<hr noshade size=1>
<dt>
<a NAME="q22a"></a><b>Wie viele Menschen haben Dasher schon benutzt?</b></dt>


<p>Mit dem Z&auml;hlen kommen wir nicht mehr nach. Bis August 2002 haben
sch&auml;tzungsweise 50,000 Anwender Dasher heruntergeladen.
<br>
<hr noshade size=1>
<dt>
<a NAME="q22"></a><b>Was werden die n&auml;chsten Schritte Ihrer Forschung
sein? Was ist letztendlich Ihr Ziel?</b></dt>

<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<p>Das erste und wichtigste Ziel haben wir erreicht -- ein System, mit
dem Menschen schreiben k&ouml;nnen, und zwar ohne Tastatur und schneller
als sie bisher schreiben konnten. Dieser Traum ist Realit&auml;t.
<p>Bis Oktober 2002 wurde das Dasher-Projekt von der gemeinn&uuml;tzigen
Gatsby Foundation gef&ouml;rdert. Es besch&auml;ftigen uns weiterhin die
folgenden Forschungsthemen:
<ul>
<li>
Eine weitere Verbesserung des Sprachmodels. Es ist schon sehr ordentlich,
aber wir k&ouml;nnen vorstellen, dass seine Geschwindigkeit um 20% und
die Kompression des Sprachmodells um ebenfalls 20% verbessert werden k&ouml;nnen.</li>

<li>
Automatische Kalibrierung des Eyetrackers. Zur Zeit wird die Leistungsf&auml;higkeit
von Dasher noch von der schlechten Kalibrierung des Eyetrackers limitiert.Wir
glauben, dass eine permanente automatische Feineinstellung des Eyetrackers
machbar ist, die auf die Steuerbewegungen des Anwenders zur&uuml;ckgreift.</li>

<li>
Verbesserungen des Navigationsmechanismus f&uuml;r den Eyetracker. Wenn
Fehler korrigiert werden m&uuml;ssen (,was nicht oft vorkommt!), f&uuml;hlt
sich die aktuelle Version noch etwas plump an. Wir arbeiten an einer modifizierten
Version des Navigationsmechanismus, mit dessen Hilfe mehrere Fehlerverfolgungs
und –korrekturwege erm&ouml;glicht werden.</li>

<li>
Wie gut die japanische Version von Dasher f&uuml;r japanische Anwender
tats&auml;chlich ist.</li>

<li>
Erstellen einer Version, die sich auch f&uuml;r solche Menschen eignet,
die nur in eine Dimension (statt zweier) zeigen k&ouml;nnen. (Dieser eindimensionale
Modus ist als Option in Dasher Version 3.0.1 enthalten, verf&uuml;gbar
ab M&auml;rz 2003.)</li>

<li>
Intregration eines Kontrollmodus in Dasher sodass ein Anwender, der keine
Kn&ouml;pfe zum Starten und Beenden von Dasher dr&uuml;cken kann, dennoch
das Schreiben durch Dasher starten und beenden kann, sofern Dasher geladen
ist, sowie weitere Steuerfunktionen. Dieses Feature ist in Dasher version
3.2 enthalten.</li>
</ul>

<hr noshade size=1>
<dt>
<a NAME="q23"></a><b>Wann werden Ihre Forschungsergebnisse umsetzungsreif
sein?</b></dt>

<br><a NAME="q23b"></a><b>Wann wird es eine "Konsumentenversion" von Dasher
geben?</b>
<p><i>Produktentwicklung und –f&ouml;rderung</i> wird als Open-Source-Project
betrieben. Die Forschungsversion von Dasher steht jetzt schon zur Verf&uuml;gung
und wird bereits von einigen behinderten Computeranwendern gerne eingesetzt.
Wir gehen davon aus, dass die Open-Source-Gemeinschaft&nbsp; eine Konsumentenversion
in ordentlicher Aufmachung innerhalb 12 Monaten anbieten kann. Der Quellcode
wurde 2002 unter der &ouml;ffentlichen GNU-lizenz publiziert. Hoffentlch
finden viele Konsumenten die Version, die Ende September 2002 publiziert
wurde, brauchbar und hilfreich. Jeder, der dieses Projekt unterst&uuml;tzen
m&ouml;chte, wende sich bitte an <a href="mailto:mackay%40mrao.cam.ac.uk">David
MacKay</a>.
<br>
<hr noshade size=1>
<dt>
<a NAME="q23a"></a><b>Warum wird Dasher als Open-Source-Projekt betrieben?</b></dt>

<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<p>Unsere Arbeit&nbsp; profitiert enorm von der Verwendung&nbsp; freier
Software.
<ul>
<li>
Das von uns verwendete Betriebssystem ist <b>GNU/Linux.</b> Es wurde kostenfrei
von&nbsp; Linus Torvalds und anderen zur Verf&uuml;gung gestellt.</li>

<li>
Wier verwenden den <b>gcc</b>-Compiler und den <b>emacs</b>-Editor, kostenfrei
zur Verf&uuml;gung gestellt von Richard Stallman.</li>

<li>
Wir verwenden <b>TeX</b> and <b>LaTeX</b>, kostenfrei zur Verf&uuml;gung
gestellt von Donald Knuth und Leslie Lamport.</li>

<li>
Wir verwenden&nbsp; <b>tcl</b> (Ousterhout), X-Windows (viele von uns),
bash (Brian Fox), und Hunderte anderer kostenloser Softwareh&auml;ppchen.</li>
</ul>
Nachdem wir so viel profitiert haben, ist uns klargeworden, dass kostenlose
Software die Welt begl&uuml;ckt. Wir m&uuml;ssten schon einen sehr guten
Grund haben, wenn wir unser Arbeitsergebnis nicht frei zug&auml;nglich
machten.
<p>Unsere Arbeit an der Universit&auml;t wird haupts&auml;chlich &ouml;ffentlich
gef&ouml;rdert, denn die Steuerzahler des vereinten K&ouml;nigreichs kommen
f&uuml;r die Kosten der Universit&auml;t auf. In gleicher Weise haben auch
US-Steuerzahler f&uuml;r Teile der von uns genutzten Software bezahlt.
<p>Das zwingendste Argument, die Software kostenfrei zu halten ist, dass
es mehr Spa&szlig; macht, in dieser Welt zu leben, wenn jedermann freigiebig
mit anderen teilt.
<p>Die Freiz&uuml;gigkeit von Dasher braucht ein Unternehmen nicht daran
zu hindern, es zu verkaufen, wie z.B. Red Hat GNU/Linux verkauft. Wenn
Unternehmen von Dasher profitieren, m&ouml;chten wir sie aber aufmuntern,
den Fortgang unserer Arbeit mit einer angemessenen Spende zu unterst&uuml;tzen.
Das Dasher-Projekt wurde von den IBM-Forschungslaboratorien Z&uuml;rich
gro&szlig;z&uuml;gig unterst&uuml;tzt. David MacKay wurde ein Partnerschaftspreis
verliehen in Anerkennung seiner fr&uuml;heren freiz&uuml;gig zur Verf&uuml;gung
gestellten Arbeitsergebnisse &uuml;ber Codes zur Fehlerkorrektur.
<p>Wir beabsichtigen, Dasher zun&auml;chst unter der „GNU public license“
(GPL) zur Verf&uuml;gung zu stellen. [Bei Bedarf kann eine sp&auml;tere
Version von Dasher unter der LGPL-Lizenz zur Verf&uuml;gung gestellt werden.]
Mit diesen Lizenzen kann, darf und soll jeder den Quellcode verwenden <b>und
sicherstellen</b>, dass modifizierte Versionen des Quellcodes in gleicher
Weise f&uuml;r jeden frei zug&auml;nglich bleiben.
<br>&nbsp;
<dt>
<b>Reden wir mal Klartext. Dasher ist ganz ausgezeichnet und hat das Potential
au&szlig;ergew&ouml;hnlich&nbsp; popul&auml;r zu werden (besonders auf
dem japanischen Markt). Dennoch machen Sie es zu einer Open Source (aus
den obengenannten Gr&uuml;nden). Hei&szlig;t das nicht, dass Palm oder
Sony oder irgendjemand Ihre Idee kaputtmachen k&ouml;nnte?</b></dt>

<br>&nbsp;
<p>&nbsp;
<br>&nbsp;
<p>Ja, es ist denkbar, dass ein Unternehmen Dasher in sein Produkt einbaut
und dass es seine Verk&auml;ufe in die H&ouml;he schnellen l&auml;sst.
Das ist in Ordnung, und ich hoffe, dass sie sich mit einer Gegenleistung
an die Gemeinschaft der Interessenten und Unterst&uuml;tzer freier Software
revanchieren – beispielsweise w&uuml;rden wir uns freuen &uuml;ber Zuwendungen
f&uuml;r Aufbau und Erhalt der Stelle eines Softwareentwicklungsbeauftragten
f&uuml;r Dasher in meiner Arbeitsgruppe.
<p>Aus drei Gr&uuml;nden halte ich Softwarepatente f&uuml;r eine schlechte
Idee:
<p>Erstens: Patente behindern eine offene Diskussion – wissenschaftliches
Arbeiten macht in einer geheimniskr&auml;merischen Umgebung keinen Spa&szlig;,
und Verst&auml;ndigung ist essenziell f&uuml;r den Fortschritt. Ich k&ouml;nnte
wahrscheinlich keine Doktoranden f&uuml;r die Arbeit an Ideen wie Dasher
gewinnen, wenn ich sie zw&auml;nge, meine Ideen geheimzuhalten. Dasher
w&auml;re wohl nie aus dem Grundstadium herausgekommen.
<p>Zweitens verhindern Softwarepatente, dass beste Softwarel&ouml;sungen
verwendet werden - ein treffendes Beispiel ist das weithin verwendete "gif"-Format
f&uuml;r Bilder: Compuserve und Unisys betreiben allem Anschein nach ein
Patent des Kompressionsalgorithmus, der &uuml;blicherweise eingesetzt wurde,
um gif-Images sch&ouml;n klein zu machen. Deshalb wird jeder die Verwendung
eines netten einfachen Standards einstellen m&uuml;ssen.
<p>Drittens meine ich, dass sogar verdiente Erfinder recht selten irgendeinen
finanziellen Vorteil aus einem Softwarepatent erzielen. <b>Es ist aussichtslos</b>.
Diejenigen, die von Patenten profitieren sind (a) Patentanw&auml;lte und
(b) Gro&szlig;unternehmen, die Patente als Drohmittel einsetzen, um andere
Firmen zu Vereinbarungen zu zwingen. Wenn ich ein Patent h&auml;tte und
ein Gro&szlig;unternehmen es verletzte, was k&ouml;nnte ich dagegen tun?
Sie k&ouml;nnen mehr Geld in die juristische Schlacht werfen als ich. Und
sie w&uuml;rden zweifellos unterstellen und gegenhalten, dass ich einen
ganzen Stapel von ihren Patenten verletzte. Sogar in der physischen Welt
erscheinen Patent ziemlich nutzlos. Nehmen Sie Herrn Dyson mit seinen beutelfreien
Staubsaugern. Hat nicht Hoover sein Patent verletzt, und hat es ihn nicht
zehn jammervolle Jahre gekostet, damit die Missachtung seiner Rechte gerichtliche
Anerkennung fand?
<br>
<hr noshade size=1>
<dt>
<a NAME="q24"></a><b>Von wem wurde Ihre Forschung gef&ouml;rdert?</b></dt>
<p>Die "blue-skies"-Forschung der "Inference group" wird unterst&uuml;tzt
von der&nbsp; gemeinn&uuml;tzigen Gatsby Charitable Foundation und durch
den Partnerschaftspreis des Forschungslabors IBM Z&uuml;rich.
<p>Das Dasher-Projekt ist (bisher) fast ohne Mittel betrieben worden und
ohne weitere F&ouml;rderungsantr&auml;ge.
<p><i>Unterst&uuml;tzung f&uuml;r die Weiterentwicklung von Dasher ist
willkommen!</i>
<br>
<hr noshade size=1>
<dt>
<a NAME="q25"></a><b>Was ist Ihr "Dienstgrad", wie sollte man sich auf
Sie beziehen und wie an Sie wenden?</b></dt>

<br>&nbsp;
<p><b>David MacKay</b> ist <i>Reader* in Natural Philosophy</i> in der
Fakult&auml;t f&uuml;r Physik ander Universit&auml;t Cambridge. Er ist
auch Mitbegr&uuml;nder der IT-Firma <a href="http://www.transversal.com/">Transversal</a>.
<br>[(*) Ein "Reader" w&auml;re nach der&nbsp; U.S- und der deutschen Terminologie
in etwa ein Professor oder Privatdozent.]
<p>David Ward hat das gr&ouml;&szlig;te St&uuml;ck der harten Arbeit erledigt,
Dasher von der Idee in eine funktionst&uuml;chtige Wirklichkeit zu konvertieren.
Er wurde an der Fakult&auml;t f&uuml;r Physik promoviert und arbeitet nun
f&uuml;r ein Softwareunternehmen in Cambridge.
<p>Wir w&uuml;rden gerne David Ward und David MacKay genannt werden, oder
Dr. David Ward und Dr. David MacKay.
<br>
<hr noshade size=1>
<dt>
<a NAME="q26"></a><b>Was w&uuml;rden Sie sonst noch gerne sagen?</b></dt>

<p>Ausf&uuml;hrbare Programmkopien der Dasher-Software k&ouml;nnen kostenlos
von der Website des Dasher-Projekts heruntergeladen werden,
<a href="http://www.inference.phy.cam.ac.uk/dasher/">http://www.inference.phy.cam.ac.uk/dasher/</a>.
Dort finden Sie auch Tipps f&uuml;r Neulinge. Geben Sie nicht auf - es
kostet Sie ein bis zwei Minuten um anzufangen – innerhalb zehn Minuten
werden Sie bereits “dashen“.
<br>Probieren Sie es aus!
<p>Zuwendungen zur Unterst&uuml;tzung unserer Forschung sind jederzeit
willkommen.
<br>&nbsp;</dl>


</td></tr><tr><td>
<hr size=1 noshade><div align=right>The Inference Group is supported  by the Gatsby Foundation<br> and by a partnership award from IBM Zurich Research Laboratory<hr size=2 noshade><A HREF="http://www.inference.phy.cam.ac.uk/mackay/">David MacKay</a></div><div align=left>Site last modified Wed Jul 23 01:35:20 BST 2003
</div>
   </font>
</td></tr></table>
</td>
</tr>
 </table>
</body></html>
